## merge

In [10]:
import pandas as pd

# Left DataFrame
df1 = pd.DataFrame({
    'emp_id': [1, 2, 3, 4],
    'name': ['Dipak', 'Sita', 'Ram', 'Gita'],
    'dept_id': [101, 102, 101, 103]
})

df1

   emp_id   name  dept_id
0       1  Dipak      101
1       2   Sita      102
2       3    Ram      101
3       4   Gita      103

In [3]:
# Right DataFrame
df2 = pd.DataFrame({
    'dept_id': [101, 102, 103],
    'department': ['IT', 'HR', 'Finance']
})

df2

   dept_id department
0      101         IT
1      102         HR
2      103    Finance

In [11]:
# Merge based on common column 'dept_id'
merged_df = pd.merge(df1, df2, on='dept_id', how='inner')

merged_df

   emp_id   name  dept_id department
0       1  Dipak      101         IT
1       2   Sita      102         HR
2       3    Ram      101         IT
3       4   Gita      103    Finance

In [9]:
merged_df = pd.merge(df1, df2, on='dept_id', how='outer')

merged_df

   emp_id   name  dept_id department
0       1  Dipak      101         IT
1       3    Ram      101         IT
2       2   Sita      102         HR
3       4   Gita      103    Finance

In [12]:
merged_df = pd.merge(df1, df2, on='dept_id', how='left')

merged_df

   emp_id   name  dept_id department
0       1  Dipak      101         IT
1       2   Sita      102         HR
2       3    Ram      101         IT
3       4   Gita      103    Finance

In [13]:
merged_df = pd.merge(df1, df2, on='dept_id', how='right')

merged_df

   emp_id   name  dept_id department
0       1  Dipak      101         IT
1       3    Ram      101         IT
2       2   Sita      102         HR
3       4   Gita      103    Finance